run/backwardStep_Kn0.18/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

boundaryField
{
    INLET
    {
        type            fixedValue;
        value   uniform 330;
    }

    OUTLET
    {
        type            zeroGradient;
    }

    WALL
    {
        type            fixedValue;
        value   uniform 300;
    }

    SYMMETRY
    {
        type            symmetry;
    }
       
}

// ************************************************************************* //
